app/views/evaluations/show.html.erb

SELECT "results".* FROM "results"  WHERE "results"."evaluation_id" = 1 AND "results"."ratee_id" = 1
---
	  	<tbody>
  	  	<% Result.where(evaluation_id: @evaluation.id, ratee_id: current_developer.id).each do |result| %>

SELECT  "materials".* FROM "materials"  WHERE "materials"."id" = $1 LIMIT 1  [["id", 1]]
---
      	  	<td>
        			<%= Material.find(result.material_id).subject %>,
        		점수: <%= result.value %>