app/views/devise/registrations/edit.html.erb

SELECT COUNT(*) FROM "results"  WHERE "results"."rater_id" = 1
SELECT SUM("results"."value") AS sum_id FROM "results"  WHERE "results"."rater_id" = 1
SELECT "materials".* FROM "materials"  WHERE "materials"."developer_id" = 2
SELECT COUNT(*) FROM "materials"  WHERE "materials"."developer_id" = 2
---
      <div>
        <p>평가한 자료 수: <%= Result.where(rater_id: current_developer.id).count %> </p>
        <p>평가 평점: <% if (cnt = Result.where(rater_id: current_developer.id).count) > 0 %><%= Result.where(rater_id: current_developer.id).sum(:value)/cnt %> <% else %>0.0<% end %> </p>
        <p> 올린 자료의 수: <%= current_developer.materials.count %></p>