app/views/admin/evaluation.html.erb

SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "mappings"  WHERE "mappings"."evaluation_id" = 1) subquery_for_count
---

<% unless @evaluation.mappings.count>0 %>