app/views/mappings/_index.html.erb

SELECT "applieds".* FROM "applieds"  WHERE "applieds"."ratee_group_id" = 1
---
          <h4>피평가자</h4>
          <% mapping.ratee_group.applieds.each do |applied| %>

SELECT "selecteds".* FROM "selecteds"  WHERE "selecteds"."rater_group_id" = 1
---
          <h4>평가자</h4>
          <% mapping.rater_group.selecteds.each do |selected| %>