app/controllers/admin_controller.rb

  def evaluations
  	@evaluations = Evaluation.all
---
SELECT "evaluations".* FROM "evaluations"