app/controllers/admin_controller.rb

  def developers
  	@developers = Developer.all
---
SELECT "developers".* FROM "developers"

  def developer
    developer = Developer.where(email: params[:search])[0]

    _begin = DateTime.civil(*params[:begin].sort.map(&:last).map(&:to_i))
    _end = DateTime.civil(*params[:end].sort.map(&:last).map(&:to_i)).end_of_day

    unless developer
      redirect_to admin_developers_path

    else

    case params[:format]

    when '1'
      case params[:period]

      when "today"
        @careers = Career.where(created_at: Time.zone.now.all_day, developer_id: developer.id)
      when "7days"
        @careers = Career.where(created_at: 7.days.ago.at_beginning_of_day..Time.now.at_end_of_day, developer_id: developer.id)
      when "period"
        @careers = Career.where(created_at: _begin.._end, developer_id: developer.id)
      end
    when '2'
      case params[:period]

      when "today"
        @materials = Material.where(created_at: Time.zone.now.all_day, developer_id: developer.id)
---
SELECT "developers".* FROM "developers"  WHERE "developers"."email" = 'student2@ex.com'
SELECT "careers".* FROM "careers"  WHERE ("careers"."created_at" BETWEEN '2014-12-03 00:00:00.000000' AND '2014-12-03 23:59:59.999999') AND "careers"."developer_id" = 2
SELECT "materials".* FROM "materials"  WHERE ("materials"."created_at" BETWEEN '2014-11-26 00:00:00.000000' AND '2014-12-03 14:59:59.999999') AND "materials"."developer_id" = 2

  def evaluations
  	@evaluations = Evaluation.all.order('id ASC')
---
SELECT "evaluations".* FROM "evaluations"   ORDER BY id ASC

  def evaluation
  	@evaluation = Evaluation.find(params[:id])
---
SELECT  "evaluations".* FROM "evaluations"  WHERE "evaluations"."id" = $1 LIMIT 1  [["id", 1]]

  def materials
    if params[:field] == "-1"
      @materials = Material.all
    elsif params[:field]
      @materials = Material.where(field: params[:field])
---
SELECT "materials".* FROM "materials"
SELECT "materials".* FROM "materials"  WHERE "materials"."field" = 0

  def material
    @material = Material.find(params[:id])
    @results = Result.where(material_id: @material.id)
---
SELECT  "materials".* FROM "materials"  WHERE "materials"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "results".* FROM "results"  WHERE "results"."material_id" = 1