app/controllers/career_controller.rb

	def index
		@careers = current_developer.careers
		@materials = current_developer.materials
		@received_results = Result.where(ratee_id: current_developer.id)
		@gived_results = Result.where(rater_id: current_developer.id)
		@applieds = current_developer.applieds
		@selecteds = current_developer.selecteds
---
SELECT "results".* FROM "results"  WHERE "results"."ratee_id" = 1
SELECT "results".* FROM "results"  WHERE "results"."rater_id" = 1
SELECT "applieds".* FROM "applieds"  WHERE "applieds"."developer_id" = 2
SELECT "careers".* FROM "careers"  WHERE "careers"."developer_id" = 1
SELECT "materials".* FROM "materials"  WHERE "materials"."developer_id" = 1
SELECT "selecteds".* FROM "selecteds"  WHERE "selecteds"."developer_id" = 2

	def search
		_begin = DateTime.civil(*params[:begin].sort.map(&:last).map(&:to_i))
		_end = DateTime.civil(*params[:end].sort.map(&:last).map(&:to_i)).end_of_day

		case params[:format]

		when '1'
			case params[:period]

			when "today"
  			@careers = Career.where(created_at: Time.zone.now.all_day, developer_id: current_developer.id)
  		when "7days"
  			@careers = Career.where(created_at: 7.days.ago.at_beginning_of_day..Time.now.at_end_of_day, developer_id: current_developer.id)
  		when "period"
  			@careers = Career.where(created_at: _begin.._end, developer_id: current_developer.id)
  		end
		when '2'
  		case params[:period]

			when "today"
  			@materials = Material.where(created_at: Time.zone.now.all_day, developer_id: current_developer.id)
  		when "7days"
  			@materials = Material.where(created_at: 7.days.ago.at_beginning_of_day..Time.now.at_end_of_day, developer_id: current_developer.id)
  		when "period"
  			@materials = Material.where(created_at: _begin.._end, developer_id: current_developer.id)
  		end
		when '3'
  		case params[:period]

			when "today"
  			@received_results = Result.where(created_at: Time.zone.now.all_day, ratee_id: current_developer.id)
---
SELECT "careers".* FROM "careers"  WHERE ("careers"."created_at" BETWEEN '2014-12-01 00:00:00.000000' AND '2014-12-01 23:59:59.999999') AND "careers"."developer_id" = 2
SELECT "materials".* FROM "materials"  WHERE ("materials"."created_at" BETWEEN '2014-12-01 00:00:00.000000' AND '2014-12-01 23:59:59.999999') AND "materials"."developer_id" = 2
SELECT "results".* FROM "results"  WHERE ("results"."created_at" BETWEEN '2014-12-01 00:00:00.000000' AND '2014-12-01 23:59:59.999999') AND "results"."ratee_id" = 2

  		case params[:period]

			when "today"
  			@gived_results = Result.where(created_at: Time.zone.now.all_day, rater_id: current_developer.id)
---
SELECT "results".* FROM "results"  WHERE ("results"."created_at" BETWEEN '2014-12-01 00:00:00.000000' AND '2014-12-01 23:59:59.999999') AND "results"."rater_id" = 2

	def change_company
		@developer = Developer.find(params[:developer_id])

		if Company.where(name: params[:new_company].to_s).count > 0
			if @developer.cname == params[:new_company].to_s
				redirect_to edit_developer_registration_path(@developer), notice: '현재 회사와 동일합니다.'
				return
			end
			@career = @developer.careers.new(prev: @developer.cname, current: params[:new_company])
			@career.save
			@developer.cname = params[:new_company]
			@developer.save
---
SELECT  "developers".* FROM "developers"  WHERE "developers"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "companies".* FROM "companies"  WHERE "companies"."name" = $1 LIMIT 1  [["name", "123"]]
SELECT COUNT(*) FROM "companies"  WHERE "companies"."name" = '1234'
INSERT INTO "careers" ("created_at", "current", "developer_id", "prev", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-11-30 09:06:56.967027"], ["current", "123"], ["developer_id", 1], ["prev", "freelancer"], ["updated_at", "2014-11-30 09:06:56.967027"]]
UPDATE "developers" SET "cname" = $1, "updated_at" = $2 WHERE "developers"."id" = 1  [["cname", "123"], ["updated_at", "2014-11-30 09:06:56.974492"]]

	def change_department
		@developer = Developer.find(params[:developer_id])

		if Department.where(dname: params[:new_department].to_s, cname: @developer.cname).count > 0
			if @developer.dname == params[:new_department].to_s
				redirect_to edit_developer_registration_path(@developer), notice: '현재 회사와 동일합니다.'
				return
			end

			@career = @developer.careers.new(prev: @developer.dname, current: params[:new_department])
			@career.save
			@developer.dname = params[:new_department]
			@developer.save
---
SELECT  "developers".* FROM "developers"  WHERE "developers"."id" = $1 LIMIT 1  [["id", 1]]
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "departments"  WHERE "departments"."dname" = '123' AND "departments"."cname" = 'freelancer') subquery_for_count
INSERT INTO "careers" ("created_at", "current", "developer_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-11-30 11:12:28.703686"], ["current", "602호"], ["developer_id", 1], ["updated_at", "2014-11-30 11:12:28.703686"]]
UPDATE "developers" SET "dname" = $1, "updated_at" = $2 WHERE "developers"."id" = 1  [["dname", "602호"], ["updated_at", "2014-11-30 11:12:28.708353"]]