app/controllers/companies_controller.rb

  def index
    if params[:field]
      @companies = Company.all.sort_by {|company| company.get_field_avg(params[:field]) }.reverse
---
SELECT "companies".* FROM "companies"

  def show
    @departments = @company.departments
    @evaluations = Evaluation.all
---
SELECT "evaluations".* FROM "evaluations"

  def create
    @company = Company.new(company_params)

    respond_to do |format|
      if @company.save
---
INSERT INTO "companies" ("name") VALUES ($1) RETURNING "name"  [["name", "경선파인"]]

  def destroy
    if @company.name == "freelancer"
      redirect_to companies_url, notice: '이 회사는 삭제할 수 없습니다.'
      return
    end
    @company.destroy
---
DELETE FROM "companies" WHERE "companies"."name" = $1  [["name", "123"]]

    def set_company
      @company = Company.find(params[:name])
---
SELECT  "companies".* FROM "companies"  WHERE "companies"."name" = $1 LIMIT 1  [["name", "경선파인"]]