app/controllers/departments_controller.rb

SELECT  "companies".* FROM "companies"  WHERE "companies"."name" = $1 LIMIT 1  [["name", "경선파인"]]
---
  def index
    @departments = Company.find(params[:company_name]).departments

SELECT  "companies".* FROM "companies"  WHERE "companies"."name" = $1 LIMIT 1  [["name", "경선파인"]]
---
  def new
    @company = Company.find(params[:company_name])

SELECT  "companies".* FROM "companies"  WHERE "companies"."name" = $1 LIMIT 1  [["name", "경선파인"]]
INSERT INTO "departments" ("cname", "dname") VALUES ($1, $2) RETURNING "dname","cname"  [["cname", "경선파인"], ["dname", "501호"]]
---
  def create
    @company = Company.find(params[:company_name])
    @department = Company.find(params[:company_name]).departments.new(department_params)

    respond_to do |format|
      if @department.save

SELECT  "departments".* FROM "departments"  WHERE ("departments"."dname" = $1 AND "departments"."cname" = $2) LIMIT 1  [["dname", nil], ["cname", "경선파인"]]
---
    def set_department
      @department = Department.find(params[:dname_cname])