app/controllers/evaluations_controller.rb

	def index
		@evaluations = Evaluation.all
---
SELECT "evaluations".* FROM "evaluations"