app/controllers/evaluations_controller.rb

SELECT "evaluations".* FROM "evaluations"   ORDER BY id ASC
---
	def index
		@evaluations = Evaluation.all.order('id ASC')

SELECT  "evaluations".* FROM "evaluations"  WHERE "evaluations"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "mappings".* FROM "mappings"  WHERE "mappings"."evaluation_id" = 1
SELECT "selecteds".* FROM "selecteds"  WHERE "selecteds"."evaluation_id" = 1 AND "selecteds"."developer_id" = 1
SELECT "applieds".* FROM "applieds"  WHERE "applieds"."ratee_group_id" = 1
---
	def show
		@evaluation = Evaluation.find(params[:id])
    @mappings = @evaluation.mappings
    @selected = Selected.where(evaluation_id: @evaluation.id, developer_id: current_developer.id)[0]
    if @selected
      rater_group = @selected.rater_group
      mappings = rater_group.mappings

      ratees = []
      mappings.each do |mapping|
        mapping.ratee_group.applieds.each do |a|

INSERT INTO "evaluations" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2014-11-29 05:20:00.777707"], ["updated_at", "2014-11-29 05:20:00.777707"]]
---
	def create
		@evaluation = Evaluation.create()

SELECT  "evaluations".* FROM "evaluations"  WHERE "evaluations"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "evaluations" SET "processed" = $1, "updated_at" = $2 WHERE "evaluations"."id" = 1  [["processed", "t"], ["updated_at", "2014-12-01 03:36:37.507001"]]
---
  def close
    @evaluation = Evaluation.find(params[:id])
    if @evaluation
      @evaluation.processed = true
      if @evaluation.save

SELECT  "evaluations".* FROM "evaluations"  WHERE "evaluations"."id" = $1 LIMIT 1  [["id", 2]]
SELECT COUNT(*) FROM "applieds"  WHERE "applieds"."evaluation_id" = 2 AND "applieds"."developer_id" = 2
INSERT INTO "applieds" ("created_at", "developer_id", "evaluation_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-11-30 17:40:43.509961"], ["developer_id", 2], ["evaluation_id", 2], ["updated_at", "2014-11-30 17:40:43.509961"]]
---
  def apply
    @evaluation = Evaluation.find(params[:id])

    if Applied.where(evaluation_id: @evaluation.id, developer_id: current_developer.id).count==0
      @applied = @evaluation.applieds.new
      @applied.developer_id = current_developer.id
      if @applied.save

SELECT  "evaluations".* FROM "evaluations"  WHERE "evaluations"."id" = $1 LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "applieds"  WHERE "applieds"."evaluation_id" = 1
---
  def map
    @evaluation = Evaluation.find(params[:id])

    if @evaluation.appliable && (@evaluation.processed==false)
      if params[:rateemem] && params[:ratermem]
        if (params[:rateemem].to_i > 0) && (params[:ratermem].to_i > 0)

          # Constraint
          if params[:rateemem].to_i > @evaluation.applieds.count

INSERT INTO "ratee_groups" ("evaluation_id") VALUES ($1) RETURNING "id"  [["evaluation_id", 1]]
INSERT INTO "rater_groups" ("evaluation_id") VALUES ($1) RETURNING "id"  [["evaluation_id", 1]]
---
          end

          for i in 1..total_ratee_groups
            @evaluation.ratee_groups.create
          end

          for i in 1..total_rater_groups
            @evaluation.rater_groups.create

INSERT INTO "mappings" ("evaluation_id", "ratee_group_id", "rater_group_id") VALUES ($1, $2, $3) RETURNING "ratee_group_id","rater_group_id"  [["evaluation_id", 1], ["ratee_group_id", 2], ["rater_group_id", 2]]
---
          ratergroups = @evaluation.rater_groups

          for i in 0..(total_ratee_groups-1)
            @evaluation.mappings.create(ratee_group_id: rateegroups[i].id,
            rater_group_id: rateegroups[i%total_rater_groups].id)

SELECT  "developers".* FROM "developers"  WHERE "developers"."admin" = 'f'  ORDER BY RANDOM() LIMIT 4
SELECT  "selecteds".* FROM "selecteds"  WHERE "selecteds"."evaluation_id" = 1  ORDER BY RANDOM() LIMIT 4
SELECT  "applieds".* FROM "applieds"  WHERE "applieds"."evaluation_id" = 1  ORDER BY RANDOM() LIMIT 7
---
            puts "======================"

            # select raters
            selected_developers = Developer.where(admin: false).order("RANDOM()").first(num_of_selecteds)
            selected_developers.each do |developer|
              @evaluation.selecteds.new(developer_id: developer.id)
            end

            applieds = @evaluation.applieds.order("RANDOM()").first(num_of_appliers)

SELECT "mappings".* FROM "mappings"  WHERE "mappings"."rater_group_id" = 2
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "mappings"  WHERE "mappings"."rater_group_id" = 2) subquery_for_count
---
                next
              end

              mapped_ratee_group = Mapping.where(rater_group_id: ratergroups[group_selector%total_rater_groups].id)

INSERT INTO "selecteds" ("created_at", "developer_id", "evaluation_id", "rater_group_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-12-01 15:01:40.969719"], ["developer_id", 1], ["evaluation_id", 2], ["rater_group_id", 2], ["updated_at", "2014-12-01 15:01:40.969719"]]
UPDATE "selecteds" SET "rater_group_id" = $1, "updated_at" = $2 WHERE "selecteds"."id" = 3  [["rater_group_id", 1], ["updated_at", "2014-11-29 13:40:35.339190"]]
UPDATE "applieds" SET "ratee_group_id" = $1, "updated_at" = $2 WHERE "applieds"."id" = 2  [["ratee_group_id", 2], ["updated_at", "2014-11-29 13:27:30.581936"]]
---

          # save db
          for u in 0..(selecteds.count-1)
            selecteds[u].save
          end

          for v in 0..(applieds.count-1)
            applieds[v].save

UPDATE "evaluations" SET "appliable" = $1, "updated_at" = $2 WHERE "evaluations"."id" = 2  [["appliable", "f"], ["updated_at", "2014-12-01 15:01:40.979965"]]
---
          # end

          @evaluation.appliable = false
          @evaluation.save