app/controllers/home_controller.rb

	def index
		evals = Evaluation.where(appliable: false, processed: false)
		if evals.count == 1
			@eval = evals[0]
			selected = Selected.where(developer_id: current_developer.id, evaluation_id: @eval.id)
			if selected.count == 1
				mappings = Mapping.where(rater_group_id: selected[0].rater_group_id)
				applieds = []
				for i in 0..mappings.count-1
					applieds += Applied.where(ratee_group_id: mappings[i].ratee_group_id)
				end

				@jobs = []
				for i in 0..applieds.count-1
					@jobs += Material.where(developer_id: applieds[i].developer_id)
				end

				results = Result.where(evaluation_id: @eval.id)
				resulted_materials = []
				for i in 0..results.count-1
					resulted_materials += [Material.find(results[i].material_id)]
---
SELECT "evaluations".* FROM "evaluations"  WHERE "evaluations"."appliable" = 'f' AND "evaluations"."processed" = 'f'
SELECT COUNT(*) FROM "evaluations"  WHERE "evaluations"."appliable" = 'f' AND "evaluations"."processed" = 'f'
SELECT "selecteds".* FROM "selecteds"  WHERE "selecteds"."developer_id" = 2 AND "selecteds"."evaluation_id" = 1
SELECT COUNT(*) FROM "selecteds"  WHERE "selecteds"."developer_id" = 2 AND "selecteds"."evaluation_id" = 1
SELECT "mappings".* FROM "mappings"  WHERE "mappings"."rater_group_id" = 1
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "mappings"  WHERE "mappings"."rater_group_id" = 1) subquery_for_count
SELECT "applieds".* FROM "applieds"  WHERE "applieds"."ratee_group_id" = 1
SELECT "materials".* FROM "materials"  WHERE "materials"."developer_id" = 1
SELECT "results".* FROM "results"  WHERE "results"."evaluation_id" = 1
SELECT COUNT(*) FROM "results"  WHERE "results"."evaluation_id" = 1
SELECT  "materials".* FROM "materials"  WHERE "materials"."id" = $1 LIMIT 1  [["id", 1]]