app/controllers/materials_controller.rb

SELECT "results".* FROM "results"  WHERE "results"."material_id" = 2
---
  def show
    unless @material.developer_id == current_developer.id
      redirect_to materials_path
    else
      @results = Result.where(material_id: @material.id)

INSERT INTO "materials" ("content", "created_at", "developer_id", "field", "prate", "subject", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["content", "후후후후"], ["created_at", "2014-11-30 12:06:32.421999"], ["developer_id", 1], ["field", 1], ["prate", 1], ["subject", "집에가고싶다"], ["updated_at", "2014-11-30 12:06:32.421999"]]
---
  def create
    @material = current_developer.materials.new(material_params)

    respond_to do |format|
      if @material.save

SELECT  "materials".* FROM "materials"  WHERE "materials"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_material
      @material = Material.find(params[:id])