app/controllers/materials_controller.rb

  def index
    @materials = Material.all
---
SELECT "materials".* FROM "materials"