app/controllers/results_controller.rb

  def index
    @results = Result.all
---
SELECT "results".* FROM "results"

  def show
    unless (@result.ratee_id == current_developer.id) ||
      (@result.rater_id == current_developer.id)
      redirect_to materials_path
    else
      @material = Material.find(@result.material_id)
---
SELECT  "materials".* FROM "materials"  WHERE "materials"."id" = $1 LIMIT 1  [["id", 1]]

  def new
    @material = Material.find(params[:material_id])

    if Evaluation.find(params[:evaluation_id]).processed
      redirect_to root_path, notice: '평가 가능 기간이 지났습니다.'
    end

    if Result.where(rater_id: current_developer.id, material_id: @material.id, evaluation_id: params[:evaluation_id]).count > 0
---
SELECT  "materials".* FROM "materials"  WHERE "materials"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "evaluations".* FROM "evaluations"  WHERE "evaluations"."id" = $1 LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "results"  WHERE "results"."rater_id" = 2 AND "results"."material_id" = 1 AND "results"."evaluation_id" = 1

  def create
    @material = Material.find(params[:result][:material_id])
    @result = Result.new(result_params)
    @result.value *= @material.prate
    @result.ratee_cname = Developer.find(params[:result][:ratee_id]).cname

    respond_to do |format|
      if @result.save
---
SELECT  "materials".* FROM "materials"  WHERE "materials"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "developers".* FROM "developers"  WHERE "developers"."id" = 2  ORDER BY "developers"."id" ASC LIMIT 1
INSERT INTO "results" ("created_at", "evaluation_id", "material_id", "ratee_id", "rater_id", "updated_at", "value") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["created_at", "2014-11-30 16:34:17.535644"], ["evaluation_id", 1], ["material_id", 1], ["ratee_id", 1], ["rater_id", 2], ["updated_at", "2014-11-30 16:34:17.535644"], ["value", 3]]

    def set_result
      @result = Result.find(params[:id])
---
SELECT  "results".* FROM "results"  WHERE "results"."id" = $1 LIMIT 1  [["id", 2]]